Autodesk.Revit.DB.Visual.Hardwood.CommonTintColor
The property labeled "Tint Color" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.CommonTintToggle
The property labeled "Tint" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfectionsAmount
The property labeled "Amount" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "-10, 10".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfectionsShader
The property labeled "Image" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfections
The property labeled "Relief  Pattern" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodImperfectionsType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodApplication
The property labeled "Used For" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodApplicationType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodFinish
The property labeled "Finish" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodFinishType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodTintColor
The property labeled "Stain Color" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodTintEnabled
The property labeled "Stain" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodTintEnabledType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood.HardwoodColor
The property labeled "Image" from the "Hardwood" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Hardwood
Represents the properties of materials.
Since:
2018.1